apple-open-source/macos/IOUSBFamily/AppleUSBEHCI/Classes/AppleUSBEHCI.cpp
    return stat;
}



IOReturn 
AppleUSBEHCI::DisablePeriodicSchedule(bool waitForOFF)
{
    int		i;
    IOReturn	stat = kIOReturnSuccess;
	
    if (_pEHCIRegisters->USBCMD & HostToUSBLong(kEHCICMDPeriodicEnable))
    {
		USBLog(7, "AppleUSBEHCI[%p]::DisablePeriodicSchedule: disabling schedule",  this);
		// 4627732 - we used to wait for the bits to get synched up, but there doesn't seem to be
		// a compelling reason to do so according to the EHCI spec, so we no longer do that
		_pEHCIRegisters->USBCMD &= HostToUSBLong(~kEHCICMDPeriodicEnable);
			
		if (waitForOFF)					// 4627732 - only wait if we explicitly say to
		{
			for (i=0; (i < 100) && (USBToHostLong(_pEHCIRegisters->USBSTS) & kEHCISTSPeriodicScheduleStatus); i++)
				IOSleep(1);

			if (i)
			{
				if (i >= 100)
				{
					USBLog(1, "AppleUSBEHCI[%p]::DisablePeriodicSchedule: ERROR: USBCMD and USBSTS won't synchronize OFF",  this);
					USBTrace( kUSBTEHCI, kTPEHCIDisablePeriodicSchedule , (uintptr_t)this, USBToHostLong(_pEHCIRegisters->USBCMD), USBToHostLong(_pEHCIRegisters->USBSTS), kIOReturnInternalError );
					stat = kIOReturnInternalError;
				}
				else
				{
					USBLog(7, "AppleUSBEHCI[%p]::DisablePeriodicSchedule: had to wait %d ms for CMD and STS to synch up OFF",  this, i);
				}
			}
		}
    }
    else
    {
		USBLog(7, "AppleUSBEHCI[%p]::DisablePeriodicSchedule: schedule was already disabled",  this);
    }
    
    if (stat)
    {
		USBLog(1, "AppleUSBEHCI[%p]::DisablePeriodicSchedule: returning status %x",  this, stat);
		USBTrace( kUSBTEHCI, kTPEHCIDisablePeriodicSchedule , (uintptr_t)this, stat, 0, 0);
    }
    else
    {
		USBLog(7, "AppleUSBEHCI[%p]::DisablePeriodicSchedule: schedule disabled cleanly",  this);
    }
    
    return stat;
}



IOUSBControllerListElement *
AppleUSBEHCI::GetPeriodicListLogicalEntry(int offset)
{
	return _logicalPeriodicList[offset];
}



USBPhysicalAddress32 
AppleUSBEHCI::GetPeriodicListPhysicalEntry(int offset)
{
	return USBToHostLong(_periodicList[offset]);
}



void 
AppleUSBEHCI::SetPeriodicListEntry(int offset, IOUSBControllerListElement *pListElem)
{
	_logicalPeriodicList[offset] = pListElem;
	if (pListElem)
	{
		_periodicList[offset] = HostToUSBLong(pListElem->GetPhysicalAddrWithType());
	}
	else
	{
		_periodicList[offset] = HostToUSBLong(kEHCITermFlag);
	}
	// WE CAN'T LOG HERE SINCE THIS IS USED BY FilterInterrupt
	//USBLog(5, "AppleUSBEHCI[%p]::SetPeriodicListEntry - offset(%d) _logicalPeriodicList[%p] _periodicList[%p]", this, offset, _logicalPeriodicList[offset], (void*)_periodicList[offset]);
}



IOReturn
AppleUSBEHCI::message( UInt32 type, IOService * provider,  void * argument )
{
	IOService *					nub = NULL;
	const IORegistryPlane *		usbPlane = NULL;
	IOUSBRootHubDevice *		parentHub = NULL;
	IOReturn					returnValue = kIOReturnSuccess;
	
    USBLog(6, "AppleUSBEHCI[%p]::message type: %p, isInactive = %d",  this, (void*)type, isInactive());

    // Let our superclass decide handle this method
    // messages
    //
    returnValue = super::message( type, provider, argument );
	
	switch (type)
	{
		case kIOUSBMessageExpressCardCantWake:
			nub = (IOService*)argument;
			usbPlane = getPlane(kIOUSBPlane);
			parentHub = OSDynamicCast(IOUSBRootHubDevice, nub->getParentEntry(usbPlane));

			nub->retain();
			USBLog(1, "AppleUSBEHCI[%p]::message - got kIOUSBMessageExpressCardCantWake from driver %s[%p] argument is %s[%p]", this, provider->getName(), provider, nub->getName(), nub);
			USBTrace( kUSBTEHCI, kTPEHCIMessage , (uintptr_t)this, (uintptr_t)provider, (uintptr_t)nub, kIOUSBMessageExpressCardCantWake );
			if ( parentHub == _rootHubDevice || (nub == _rootHubDevice && parentHub == NULL) )
			{
				USBLog(1, "AppleUSBEHCI[%p]::message - device is attached to my root hub!!", this);
				USBTrace( kUSBTEHCI, kTPEHCIMessage , (uintptr_t)this, 0, 0, 0);
				_badExpressCardAttached = true;
			}
			nub->release();
			returnValue = kIOReturnSuccess;  // this message was handled
			break;
			
	}
	
	return returnValue;
}


UInt32
AppleUSBEHCI::AllocateExtraRootHubPortPower(UInt32 extraPowerRequested)
{
	if (_extraPower.version != kAppleEHCIExtraPowerVersion)
	{
		USBLog(2, "AppleUSBEHCI[%p]::AllocateExtraRootHubPortPower - extra power not available on this controller", this);
		return 0;
	}
	
	// 0 - that seems silly
	if (!extraPowerRequested)
	{
		USBLog(7, "AppleUSBEHCI[%p]::AllocateExtraRootHubPortPower(kIOUSBMessageRequestExtraPower) - no extra power requested - fine with me", this);
		return 0;
	}
	
	// requesting new power
	
	// check to make sure there is enough aggregate
	if ((UInt32)extraPowerRequested > _extraPower.aggregate)
	{
		USBLog(2, "AppleUSBEHCI[%p]::AllocateExtraRootHubPortPower - no extra power available", this);
		return 0;
	}
	
	// now check to make sure there is enough on each port
	if ((UInt32)extraPowerRequested > _extraPower.perPort)
	{
		USBLog(2, "AppleUSBEHCI[%p]::AllocateExtraRootHubPortPower - no per port power available", this);
		return 0;
	}
	
	_extraPower.aggregate = _extraPower.aggregate - extraPowerRequested;
	USBLog(2, "AppleUSBEHCI[%p]::AllocateExtraRootHubPortPower - requested(%d) - aggregate now at (%d)", this, (int)extraPowerRequested, (int)_extraPower.aggregate);
	return extraPowerRequested;
}



void
AppleUSBEHCI::ReturnExtraRootHubPortPower(UInt32 extraPowerReturned)
{
	// someone is giving the extra power back
	_extraPower.aggregate = _extraPower.aggregate + extraPowerReturned;
	USBLog(2, "AppleUSBEHCI[%p]::ReturnExtraRootHubPortPower - returned(%d) - aggregate now at (%d)", this, (int)extraPowerReturned, (int)_extraPower.aggregate);
	return;
}



IOUSBControllerIsochEndpoint*			
AppleUSBEHCI::AllocateIsochEP()
{
	AppleEHCIIsochEndpoint		*pEP;
	
	pEP = new AppleEHCIIsochEndpoint;
	if (pEP)
	{
		if (!pEP->init())
		{
			pEP->release();
			pEP = NULL;
		}
	}
	return pEP;
}



void
AppleUSBEHCI::ReturnIsochDoneQueue(IOUSBControllerIsochEndpoint* isochEP)
{
	super::ReturnIsochDoneQueue(isochEP);

	if (_activeIsochTransfers == 0)
	{	
		// Make sure that when we start isoch transfers again, we don't have a pending counter for the
		// scavenging location
		_outSlot = kEHCIPeriodicListEntries + 1;
		
}
}



IODMACommand*
AppleUSBEHCI::GetNewDMACommand()
{
	USBLog(7, "AppleUSBEHCI[%p]::GetNewDMACommand - creating %d bit IODMACommand", this, _is64bit ? 64 : 32);
	return IODMACommand::withSpecification(kIODMACommandOutputHost64, _is64bit ? 64 : 32, 0);
}



IOReturn
AppleUSBEHCI::GetLowLatencyOptionsAndPhysicalMask(IOOptionBits *pOptionBits, mach_vm_address_t *pPhysicalMask)
{
	super::GetLowLatencyOptionsAndPhysicalMask(pOptionBits, pPhysicalMask);				// get the defaults
	if (_is64bit)
		*pPhysicalMask = 0xFFFFFFFFFFFFF000ULL;											// can allow upper pages if the controller supports 64 bit
	return kIOReturnSuccess;
}



